# HostSseCurvedEdgeConditionParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..HostSseCurvedEdgeConditionParam Property
ParameterTypeId Class See Also
---
"Curved Edge Condition"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId HostSseCurvedEdgeConditionParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostSseCurvedEdgeConditionParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HostSseCurvedEdgeConditionParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace